[
    {
        "type": "message",
        "user": "U04BD6KB1",
        "text": "<@U072K0544>:  I know there are a lot of windows developers in the Ember community and historically there was a lot of focus on getting the dev tool chain working equally for all but I'm afraid I have no personal experience to share. ",
        "edited": {
            "user": "U04BD6KB1",
            "ts": "1477823808.000000"
        },
        "ts": "1477823772.001773"
    },
    {
        "type": "message",
        "user": "U072K0544",
        "text": "<@U04BD6KB1>:  thank you! I've heard feedback some time ago, that on windows ember-cli is kinda slow, but it was a while ago, so might be situation changed :) as after new macbook pro release I am kinda considering trying latest Dell XPS, which is kinda more powerful than Macbook and costs 1\/3 less :)",
        "ts": "1477826789.001775"
    },
    {
        "type": "message",
        "user": "U04BD6KB1",
        "text": "<@U072K0544> yeah now that you mention it ... it was specifically the build-pipeline that was _very_ slow but I think that has been addressed now. It certainly has gotten much better.",
        "ts": "1477826894.001776"
    },
    {
        "type": "message",
        "user": "U072K0544",
        "text": "I am trying to understand, if new macbook will be viable purchase for the next 3 years, as it seems previous macs served me exact this time :) and I am somehow not sure",
        "ts": "1477826983.001777"
    },
    {
        "type": "message",
        "user": "U04TVTLQ8",
        "text": "We have 4 windows devs and it's slower than Linux but completely usable. Biggest problem is npm not ember but yarn will fix that once it works for private repos. Typical build of a large app is 20 seconds on windows but rebuild is under 5 seconds. ",
        "ts": "1477831963.001778"
    },
    {
        "type": "message",
        "user": "U04TVTLQ8",
        "text": "Recommend SSD and ideally a RAM drive. ",
        "ts": "1477831986.001779"
    },
    {
        "type": "message",
        "user": "U04TVTLQ8",
        "text": "And make sure you install ember-cli-windows",
        "ts": "1477832010.001780"
    },
    {
        "type": "message",
        "user": "U14KVFYS3",
        "text": "I use Windows at home on a high end desktop. Have always been able to dev on web projects happily with only the occasional issue, although Unix tools have grown more important to me lately. I intend to go full Linux in the coming years.",
        "edited": {
            "user": "U14KVFYS3",
            "ts": "1477854307.000000"
        },
        "ts": "1477854283.001781"
    }
]