[
    {
        "type": "message",
        "user": "U06BGNMBL",
        "text": "IME passive inner ear actually gives you more bang for your buck purely in terms of quietening things down, but the other gripes I have with them outweigh that advantage",
        "ts": "1476432892.001434"
    },
    {
        "type": "message",
        "user": "U06BGNMBL",
        "text": "ie, my plantronics don't blow out of my ears if there's a wind, one of the phones doesn't slip slightly out of position unbalancing the stereo slightly, etc",
        "ts": "1476432931.001435"
    },
    {
        "type": "message",
        "user": "U0BR1H1FY",
        "text": "<@U04BD6KB1> looking forward to your talk. Are you gonna touch on the state of RethingDB?",
        "ts": "1476438747.001436"
    },
    {
        "type": "message",
        "user": "U04BD6KB1",
        "text": "Yeah well actually I'm reshaping it quite a bit; I'm going to touch briefly on Horizon\/Rethink along with my `ember-horizon` addon but then the rest will be talking about Firebase as a real-time DB interacting with Ember through Redux (and my my `ember-redux-core` addon)",
        "ts": "1476438839.001437"
    },
    {
        "type": "message",
        "user": "U04BD6KB1",
        "text": "Personally I'm hoping to see some traction in the open source community on RethinkDB post-announcement but the Slack channel hasn't given me confidence yet",
        "ts": "1476438892.001438"
    },
    {
        "type": "message",
        "user": "U04BD6KB1",
        "text": "<@U06BGNMBL> I'm pretty happy with the Jaybird x2's ... very good quality audio, reasonably good noise cancellation, great price-to-performance ratio. That said, there is a richness in sound I haven't found in the inner ears that I get from higher-end over the ears. I LOVE my v-moda over the ears but they are wired so I don't use them that much.",
        "ts": "1476439036.001439"
    },
    {
        "type": "message",
        "user": "U0BR1H1FY",
        "text": "People seem really hung up on the license, which is understandable I guess. I hope it gets picked up by apache or something. It would be a shame if it dies a slow death after this, I would still like to choose an open source realtime db over firebase, but it would definitely have to be actively maintained.",
        "ts": "1476439177.001440"
    },
    {
        "type": "message",
        "user": "U04BD6KB1",
        "text": "yes I'm completely with you on preferring open-source but I can't afford to pick a stillborn ... I think we need to wait out the next month or two to really know where this will end",
        "ts": "1476439291.001441"
    },
    {
        "type": "message",
        "user": "U04BD6KB1",
        "text": "I'm still secretly hoping that someone like Microsoft will bless this project as that's all it would take and I think Microsoft could get a lot marketing miles out of it too",
        "ts": "1476439348.001442"
    },
    {
        "type": "message",
        "user": "U04BD6KB1",
        "text": "<@U06BGNMBL> oh last thing, they have wingtips which help it stay in your ear; i use them for running and find them pretty reliable for \"staying in\"",
        "ts": "1476439633.001443"
    },
    {
        "type": "message",
        "user": "U0ASPMFPS",
        "text": "everything ends up in the Apache graveyard",
        "ts": "1476439725.001444"
    },
    {
        "type": "message",
        "user": "U0ASPMFPS",
        "text": "although CouchDB seem to be doing quite well over there",
        "ts": "1476439738.001445"
    },
    {
        "type": "message",
        "user": "U04BD6KB1",
        "text": "<@U0ASPMFPS> thanks for bringing in your sunny disposition :stuck_out_tongue:",
        "ts": "1476439783.001446"
    }
]